# TagElementCount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TagElementCount Property
ParameterTypeId Class See Also
---
"Host Count"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TagElementCount { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TagElementCount As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TagElementCount {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace